#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.lambdas_app.data.archive_file.daily_coffee: Reading...
module.lambdas_app.data.archive_file.daily_coffee: Read complete after 0s [id=10f3e7bfd18b005e7607502a64ef59a3d3605cd7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.lambdas_app.aws_iam_policy.lambda will be created
  + resource "aws_iam_policy" "lambda" {
      + arn         = (known after apply)
      + description = "AWS IAM Policy for managing aws lambda role"
      + id          = (known after apply)
      + name        = "aws_iam_policy_for_terraform_aws_lambda_role-dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.lambdas_app.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "terraform_aws_lambda_role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.lambdas_app.aws_iam_role_policy_attachment.attach_iam_policy_to_iam_role will be created
  + resource "aws_iam_role_policy_attachment" "attach_iam_policy_to_iam_role" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "terraform_aws_lambda_role-dev"
    }

  # module.lambdas_app.aws_lambda_function.daily_coffee will be created
  + resource "aws_lambda_function" "daily_coffee" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../../modules/lambdas/daily_coffee/daily_coffee.zip"
      + function_name                  = "daily_coffee-dev"
      + handler                        = "daily_coffee.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "E6m76ijMEcULwsMif8tAZ/v9lVIt5kqRjcrVt3KgddQ="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @erikmichel-dev, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*